export const taskTypesOptions = [
  {
    code: 'write',
    name: 'Написать код/скрипт с нуля',
    rules: 'Напиши рабочий код, решающий задачу.',
  },
  {
    code: 'refactor',
    name: 'Рефакторинг и улучшение',
    rules: 'Улучши код: сделай его чище, быстрее и безопаснее.',
  },
  {
    code: 'debug',
    name: 'Поиск ошибки и фикс',
    rules: 'Найди ошибку в предоставленном коде и предложи исправление.',
  },
  {
    code: 'explain',
    name: 'Объяснить, как это работает',
    rules: 'Объясни по порядку как работает этот код',
  },
  {
    code: 'security',
    name: 'Аудит безопасности',
    rules: 'Проведи аудит безопасности. Найди уязвимости.',
  },
];
